Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: You’ve seen a number of advanced tools that allow you to manipulate your commits and staging area more precisely.
cs: V této kapitole jste poznali několik pokročilých nástrojů umožňujících preciznější manipulaci s revizemi a oblastí připravených změn.

source: You’ve seen one such option already — the `-2` option, which shows only the last two commits.
cs: My už jsme se s jedním takovým parametrem setkali. Byl to parametr `-2`, který zobrazí pouze dvě poslední revize.

source: [Roberto Tyley](https://github.com/rtyley) has written a similar tool to `filter-branch` called the BFG.
cs: [Roberto Tyley](https://github.com/rtyley) vytvořil nástroj, který se funkčností podobá `filter-branch` a nazval jej BFG. (Celý název lze doslova přeložit jako Velký, přátelský, obří čistič repozitáře -- představte si pod tím, co chcete.)

source: [ticket: X]
cs: [tiket: X]

source: [ticket: X] # Please enter the commit message for your changes.
cs: [tiket: X] # Please enter the commit message for your changes.

source: `--reuseaddr` allows the server to restart without waiting for old connections to time out, the `--base-path` option allows people to clone projects without specifying the entire path, and the path at the end tells the Git daemon where to look for repositories to export.
cs: `--reuseaddr` umožňuje serveru restartování bez nutnosti čekat na vypršení časového limitu pro stará spojení, parametr `--base-path` umožňuje uživatelům klonovat projekty, aniž by museli zadávat celou cestu, a cesta na konci příkazu říká démonovi Git, kde má hledat repozitáře určené k exportu.

source: `--stdin` tells the command to read the content from stdin; if you don’t specify this, `hash-object` expects the path to a file.
cs: Parametr `--stdin` zase příkazu sděluje, aby načetl obsah ze standardního vstupu. Pokud byste parametr nezadali, příkaz `hash-object` by očekával, že zadáte cestu k souboru.

source: `HEAD~2` means "the first parent of the first parent," or "the grandparent" — it traverses the first parents the number of times you specify.
cs: `HEAD~2` označuje „prvního rodiče prvního rodiče“, tedy „prarodiče“. Příkaz překročí prvního rodiče tolikrát, kolikrát udává číselná hodnota.

source: `experiment..master` shows you everything in `master` not reachable from `experiment`:
cs: Výraz `experiment..master` zobrazí vše ve větvi `master`, co není dostupné ve větvi `experiment`:

source: `filter-branch` is the tool you probably want to use to scrub your entire history.
cs: Nástrojem, který hledáte k opravení celé historie, je `filter-branch`.

source: `git apply` is overall much more paranoid than `patch`.
cs: Příkaz `git apply` je tedy celkově víc paranoidní než příkaz `patch`.

source: `git svn` has two commands to help with this issue.
cs: Nástroj `git svn` vám k řešení tohoto problému nabízí dva příkazy.

source: and `git diff --cached` to see what you’ve staged so far:
cs: A příkaz `git diff --cached` ukáže změny, které už připraveny jsou:

source: and it works fine.
cs: a vše funguje na výbornou.

source: back to this:
cs: zpět na

source: hotfix branch based back at your master branch point.
cs: Větev „hotfix“ začleněná zpět v místě hlavní větve.

source: in the Git source code repository.
cs: spuštěným ve zdrojovém kódu Git.

source: or the second version:
cs: Nebo do druhé verze:

source: or you can edit your `~/.gitconfig` file to add these lines:
cs: nebo můžete upravit soubor `~/.gitconfig` a vložit následující řádky:

source: subject line
cs: řádek předmětu

source: to this:
cs: na:

source: what happened
cs: co bylo provedeno

source: where `convert_dir_to_date` is defined as
cs: kde `convert_dir_to_date` je definováno jako:

source: y - stage this hunk n - do not stage this hunk a - stage this and all the remaining hunks in the file d - do not stage this hunk nor any of the remaining hunks in the file g - select a hunk to go to / - search for a hunk matching the given regex j - leave this hunk undecided, see next undecided hunk J - leave this hunk undecided, see next hunk k - leave this hunk undecided, see previous undecided hunk K - leave this hunk undecided, see previous hunk s - split the current hunk into smaller hunks e - manually edit the current hunk ?
cs: y - stage this hunk n - do not stage this hunk a - stage this and all the remaining hunks in the file d - do not stage this hunk nor any of the remaining hunks in the file g - select a hunk to go to / - search for a hunk matching the given regex j - leave this hunk undecided, see next undecided hunk J - leave this hunk undecided, see next hunk k - leave this hunk undecided, see previous undecided hunk K - leave this hunk undecided, see previous hunk s - split the current hunk into smaller hunks e - manually edit the current hunk ? - print help V českém překladu: Připravit tento soubor změn [y,n,a,d,/,j,J,g,e,?]? ? y - připravit soubor změn k zapsání n - nepřipravovat soubor změn k zapsání a - připravit tento soubor změn i všechny ostatní komplexy v souboru d - nepřipravovat tento soubor změn ani žádné další komplexy v souboru g - vybrat soubor změn, k němuž má systém přejít / - najít soubor změn odpovídající danému regulárnímu výrazu j - nechat tento soubor změn nerozhodnutý, zobrazit další nerozhodnutý J - nechat tento soubor změn nerozhodnutý, zobrazit další komplex k - nechat tento soubor změn nerozhodnutý, zobrazit předchozí nerozhodnutý K - nechat tento soubor změn nerozhodnutý, zobrazit předchozí komplex s - rozdělit aktuální soubor změn do menších komplexů e - ručně editovat aktuální soubor změn ?

source: you have to use
cs: budete muset použít:

source: you put this script:
cs: vložte tento skript:
